RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/hpm_csr_regs.h
/*
 * LAM (RW)
 *
 * LAM indicates whether a Load Address Misaligned exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_LAM_MASK (0x10U)
#define CSR_MEDELEG_LAM_SHIFT (4U)
#define CSR_MEDELEG_LAM_SET(x) (((uint32_t)(x) << CSR_MEDELEG_LAM_SHIFT) & CSR_MEDELEG_LAM_MASK)
#define CSR_MEDELEG_LAM_GET(x) (((uint32_t)(x) & CSR_MEDELEG_LAM_MASK) >> CSR_MEDELEG_LAM_SHIFT)

/*
 * II (RW)
 *
 * II indicates whether an Illegal Instruction exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_II_MASK (0x4U)
#define CSR_MEDELEG_II_SHIFT (2U)
#define CSR_MEDELEG_II_SET(x) (((uint32_t)(x) << CSR_MEDELEG_II_SHIFT) & CSR_MEDELEG_II_MASK)
#define CSR_MEDELEG_II_GET(x) (((uint32_t)(x) & CSR_MEDELEG_II_MASK) >> CSR_MEDELEG_II_SHIFT)

/*
 * IAF (RW)
 *
 * IAF indicates whether an Instruction Access Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_IAF_MASK (0x2U)
#define CSR_MEDELEG_IAF_SHIFT (1U)
#define CSR_MEDELEG_IAF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_IAF_SHIFT) & CSR_MEDELEG_IAF_MASK)
#define CSR_MEDELEG_IAF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_IAF_MASK) >> CSR_MEDELEG_IAF_SHIFT)

/*
 * IAM (RW)
 *
 * IAM indicates whether an Instruction Address Misaligned exception will be delegated to S-Mode
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_IAM_MASK (0x1U)
#define CSR_MEDELEG_IAM_SHIFT (0U)
#define CSR_MEDELEG_IAM_SET(x) (((uint32_t)(x) << CSR_MEDELEG_IAM_SHIFT) & CSR_MEDELEG_IAM_MASK)
#define CSR_MEDELEG_IAM_GET(x) (((uint32_t)(x) & CSR_MEDELEG_IAM_MASK) >> CSR_MEDELEG_IAM_SHIFT)

/* Bitfield definition for register: MIDELEG */
/*
 * SEI (RW)
 *
 * SEI indicates whether an S-mode external interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_SEI_MASK (0x200U)
#define CSR_MIDELEG_SEI_SHIFT (9U)
#define CSR_MIDELEG_SEI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_SEI_SHIFT) & CSR_MIDELEG_SEI_MASK)
#define CSR_MIDELEG_SEI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_SEI_MASK) >> CSR_MIDELEG_SEI_SHIFT)

/*
 * UEI (RW)
 *
 * UEI indicates whether an U-mode external interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_UEI_MASK (0x100U)
#define CSR_MIDELEG_UEI_SHIFT (8U)
#define CSR_MIDELEG_UEI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_UEI_SHIFT) & CSR_MIDELEG_UEI_MASK)
#define CSR_MIDELEG_UEI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_UEI_MASK) >> CSR_MIDELEG_UEI_SHIFT)

/*
 * STI (RW)
 *
 * STI indicates whether an S-mode timer interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_STI_MASK (0x20U)
#define CSR_MIDELEG_STI_SHIFT (5U)
#define CSR_MIDELEG_STI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_STI_SHIFT) & CSR_MIDELEG_STI_MASK)
#define CSR_MIDELEG_STI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_STI_MASK) >> CSR_MIDELEG_STI_SHIFT)

/*
 * UTI (RW)
 *
 * UTI indicates whether an U-mode timer interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_UTI_MASK (0x10U)
#define CSR_MIDELEG_UTI_SHIFT (4U)
#define CSR_MIDELEG_UTI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_UTI_SHIFT) & CSR_MIDELEG_UTI_MASK)
#define CSR_MIDELEG_UTI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_UTI_MASK) >> CSR_MIDELEG_UTI_SHIFT)

/*
 * SSI (RW)
 *
 * SSI indicates whether an S-mode software interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_SSI_MASK (0x2U)
#define CSR_MIDELEG_SSI_SHIFT (1U)
#define CSR_MIDELEG_SSI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_SSI_SHIFT) & CSR_MIDELEG_SSI_MASK)
#define CSR_MIDELEG_SSI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_SSI_MASK) >> CSR_MIDELEG_SSI_SHIFT)

/*
 * USI (RW)
 *
 * USI indicates whether an U-mode software interrupt will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MIDELEG_USI_MASK (0x1U)
#define CSR_MIDELEG_USI_SHIFT (0U)
#define CSR_MIDELEG_USI_SET(x) (((uint32_t)(x) << CSR_MIDELEG_USI_SHIFT) & CSR_MIDELEG_USI_MASK)
#define CSR_MIDELEG_USI_GET(x) (((uint32_t)(x) & CSR_MIDELEG_USI_MASK) >> CSR_MIDELEG_USI_SHIFT)

/* Bitfield definition for register: MIE */
/*
 * PMOVI (RW)
 *
 * Performance monitor overflow local interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_MIE_PMOVI_MASK (0x40000UL)
#define CSR_MIE_PMOVI_SHIFT (18U)
#define CSR_MIE_PMOVI_SET(x) (((uint32_t)(x) << CSR_MIE_PMOVI_SHIFT) & CSR_MIE_PMOVI_MASK)
#define CSR_MIE_PMOVI_GET(x) (((uint32_t)(x) & CSR_MIE_PMOVI_MASK) >> CSR_MIE_PMOVI_SHIFT)

/*
 * BWEI (RW)
 *
 * Bus read/write transaction error local interrupt enable bit. The processor may receive bus errors on load/store instructions or cache writebacks.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_MIE_BWEI_MASK (0x20000UL)
#define CSR_MIE_BWEI_SHIFT (17U)
#define CSR_MIE_BWEI_SET(x) (((uint32_t)(x) << CSR_MIE_BWEI_SHIFT) & CSR_MIE_BWEI_MASK)
#define CSR_MIE_BWEI_GET(x) (((uint32_t)(x) & CSR_MIE_BWEI_MASK) >> CSR_MIE_BWEI_SHIFT)

/*
 * IMECCI (RW)
 *
 * Imprecise ECC error local interrupt enable bit. The processor may receive imprecise ECC errors on slave port accesses or cache writebacks.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_MIE_IMECCI_MASK (0x10000UL)
#define CSR_MIE_IMECCI_SHIFT (16U)
#define CSR_MIE_IMECCI_SET(x) (((uint32_t)(x) << CSR_MIE_IMECCI_SHIFT) & CSR_MIE_IMECCI_MASK)
#define CSR_MIE_IMECCI_GET(x) (((uint32_t)(x) & CSR_MIE_IMECCI_MASK) >> CSR_MIE_IMECCI_SHIFT)

/*
 * MEIE (RW)
 *
 * M mode external interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_MIE_MEIE_MASK (0x800U)
#define CSR_MIE_MEIE_SHIFT (11U)
#define CSR_MIE_MEIE_SET(x) (((uint32_t)(x) << CSR_MIE_MEIE_SHIFT) & CSR_MIE_MEIE_MASK)
#define CSR_MIE_MEIE_GET(x) (((uint32_t)(x) & CSR_MIE_MEIE_MASK) >> CSR_MIE_MEIE_SHIFT)

/*
 * SEIE (RW)
 *
 * S mode external interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_MIE_SEIE_MASK (0x200U)
#define CSR_MIE_SEIE_SHIFT (9U)
#define CSR_MIE_SEIE_SET(x) (((uint32_t)(x) << CSR_MIE_SEIE_SHIFT) & CSR_MIE_SEIE_MASK)
#define CSR_MIE_SEIE_GET(x) (((uint32_t)(x) & CSR_MIE_SEIE_MASK) >> CSR_MIE_SEIE_SHIFT)

