RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/hpm_csr_regs.h
/*
 * PMP4CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG1_PMP4CFG_MASK (0xFFU)
#define CSR_PMPCFG1_PMP4CFG_SHIFT (0U)
#define CSR_PMPCFG1_PMP4CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG1_PMP4CFG_SHIFT) & CSR_PMPCFG1_PMP4CFG_MASK)
#define CSR_PMPCFG1_PMP4CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG1_PMP4CFG_MASK) >> CSR_PMPCFG1_PMP4CFG_SHIFT)

/* Bitfield definition for register: PMPCFG2 */
/*
 * PMP11CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG2_PMP11CFG_MASK (0xFF000000UL)
#define CSR_PMPCFG2_PMP11CFG_SHIFT (24U)
#define CSR_PMPCFG2_PMP11CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG2_PMP11CFG_SHIFT) & CSR_PMPCFG2_PMP11CFG_MASK)
#define CSR_PMPCFG2_PMP11CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG2_PMP11CFG_MASK) >> CSR_PMPCFG2_PMP11CFG_SHIFT)

/*
 * PMP10CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG2_PMP10CFG_MASK (0xFF0000UL)
#define CSR_PMPCFG2_PMP10CFG_SHIFT (16U)
#define CSR_PMPCFG2_PMP10CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG2_PMP10CFG_SHIFT) & CSR_PMPCFG2_PMP10CFG_MASK)
#define CSR_PMPCFG2_PMP10CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG2_PMP10CFG_MASK) >> CSR_PMPCFG2_PMP10CFG_SHIFT)

/*
 * PMP9CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG2_PMP9CFG_MASK (0xFF00U)
#define CSR_PMPCFG2_PMP9CFG_SHIFT (8U)
#define CSR_PMPCFG2_PMP9CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG2_PMP9CFG_SHIFT) & CSR_PMPCFG2_PMP9CFG_MASK)
#define CSR_PMPCFG2_PMP9CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG2_PMP9CFG_MASK) >> CSR_PMPCFG2_PMP9CFG_SHIFT)

/*
 * PMP8CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG2_PMP8CFG_MASK (0xFFU)
#define CSR_PMPCFG2_PMP8CFG_SHIFT (0U)
#define CSR_PMPCFG2_PMP8CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG2_PMP8CFG_SHIFT) & CSR_PMPCFG2_PMP8CFG_MASK)
#define CSR_PMPCFG2_PMP8CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG2_PMP8CFG_MASK) >> CSR_PMPCFG2_PMP8CFG_SHIFT)

/* Bitfield definition for register: PMPCFG3 */
/*
 * PMP15CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG3_PMP15CFG_MASK (0xFF000000UL)
#define CSR_PMPCFG3_PMP15CFG_SHIFT (24U)
#define CSR_PMPCFG3_PMP15CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG3_PMP15CFG_SHIFT) & CSR_PMPCFG3_PMP15CFG_MASK)
#define CSR_PMPCFG3_PMP15CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG3_PMP15CFG_MASK) >> CSR_PMPCFG3_PMP15CFG_SHIFT)

/*
 * PMP14CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG3_PMP14CFG_MASK (0xFF0000UL)
#define CSR_PMPCFG3_PMP14CFG_SHIFT (16U)
#define CSR_PMPCFG3_PMP14CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG3_PMP14CFG_SHIFT) & CSR_PMPCFG3_PMP14CFG_MASK)
#define CSR_PMPCFG3_PMP14CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG3_PMP14CFG_MASK) >> CSR_PMPCFG3_PMP14CFG_SHIFT)

/*
 * PMP13CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG3_PMP13CFG_MASK (0xFF00U)
#define CSR_PMPCFG3_PMP13CFG_SHIFT (8U)
#define CSR_PMPCFG3_PMP13CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG3_PMP13CFG_SHIFT) & CSR_PMPCFG3_PMP13CFG_MASK)
#define CSR_PMPCFG3_PMP13CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG3_PMP13CFG_MASK) >> CSR_PMPCFG3_PMP13CFG_SHIFT)

/*
 * PMP12CFG (RW)
 *
 * See PMPCFG Table
 */
#define CSR_PMPCFG3_PMP12CFG_MASK (0xFFU)
#define CSR_PMPCFG3_PMP12CFG_SHIFT (0U)
#define CSR_PMPCFG3_PMP12CFG_SET(x) (((uint32_t)(x) << CSR_PMPCFG3_PMP12CFG_SHIFT) & CSR_PMPCFG3_PMP12CFG_MASK)
#define CSR_PMPCFG3_PMP12CFG_GET(x) (((uint32_t)(x) & CSR_PMPCFG3_PMP12CFG_MASK) >> CSR_PMPCFG3_PMP12CFG_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * Register Content :  Match Size(Byte)
 * aaaa. . . aaa0         8
 * aaaa. . . aa01         16
 * aaaa. . . a011         32
 * . . .                          . . .
 * aa01. . . 1111         2^{XLEN}
 * a011. . . 1111         2^{XLEN+1}
 * 0111. . . 1111         2^{XLEN+2}
 * 1111. . . 1111         2^{XLEN+3*1}
 */
#define CSR_PMPADDR0_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR0_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR0_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR0_PMPADDR_31_2_SHIFT) & CSR_PMPADDR0_PMPADDR_31_2_MASK)
#define CSR_PMPADDR0_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR0_PMPADDR_31_2_MASK) >> CSR_PMPADDR0_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR1_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR1_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR1_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR1_PMPADDR_31_2_SHIFT) & CSR_PMPADDR1_PMPADDR_31_2_MASK)
#define CSR_PMPADDR1_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR1_PMPADDR_31_2_MASK) >> CSR_PMPADDR1_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR2_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR2_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR2_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR2_PMPADDR_31_2_SHIFT) & CSR_PMPADDR2_PMPADDR_31_2_MASK)
#define CSR_PMPADDR2_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR2_PMPADDR_31_2_MASK) >> CSR_PMPADDR2_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR3_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR3_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR3_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR3_PMPADDR_31_2_SHIFT) & CSR_PMPADDR3_PMPADDR_31_2_MASK)
#define CSR_PMPADDR3_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR3_PMPADDR_31_2_MASK) >> CSR_PMPADDR3_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR4_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR4_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR4_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR4_PMPADDR_31_2_SHIFT) & CSR_PMPADDR4_PMPADDR_31_2_MASK)
#define CSR_PMPADDR4_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR4_PMPADDR_31_2_MASK) >> CSR_PMPADDR4_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR5_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR5_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR5_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR5_PMPADDR_31_2_SHIFT) & CSR_PMPADDR5_PMPADDR_31_2_MASK)
#define CSR_PMPADDR5_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR5_PMPADDR_31_2_MASK) >> CSR_PMPADDR5_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR6_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR6_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR6_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR6_PMPADDR_31_2_SHIFT) & CSR_PMPADDR6_PMPADDR_31_2_MASK)
#define CSR_PMPADDR6_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR6_PMPADDR_31_2_MASK) >> CSR_PMPADDR6_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR7_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR7_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR7_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR7_PMPADDR_31_2_SHIFT) & CSR_PMPADDR7_PMPADDR_31_2_MASK)
#define CSR_PMPADDR7_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR7_PMPADDR_31_2_MASK) >> CSR_PMPADDR7_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR8_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR8_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR8_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR8_PMPADDR_31_2_SHIFT) & CSR_PMPADDR8_PMPADDR_31_2_MASK)
#define CSR_PMPADDR8_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR8_PMPADDR_31_2_MASK) >> CSR_PMPADDR8_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR9_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR9_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR9_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR9_PMPADDR_31_2_SHIFT) & CSR_PMPADDR9_PMPADDR_31_2_MASK)
#define CSR_PMPADDR9_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR9_PMPADDR_31_2_MASK) >> CSR_PMPADDR9_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR10_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR10_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR10_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR10_PMPADDR_31_2_SHIFT) & CSR_PMPADDR10_PMPADDR_31_2_MASK)
#define CSR_PMPADDR10_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR10_PMPADDR_31_2_MASK) >> CSR_PMPADDR10_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR11_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR11_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR11_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR11_PMPADDR_31_2_SHIFT) & CSR_PMPADDR11_PMPADDR_31_2_MASK)
#define CSR_PMPADDR11_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR11_PMPADDR_31_2_MASK) >> CSR_PMPADDR11_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR12_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR12_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR12_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR12_PMPADDR_31_2_SHIFT) & CSR_PMPADDR12_PMPADDR_31_2_MASK)
#define CSR_PMPADDR12_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR12_PMPADDR_31_2_MASK) >> CSR_PMPADDR12_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR13_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR13_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR13_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR13_PMPADDR_31_2_SHIFT) & CSR_PMPADDR13_PMPADDR_31_2_MASK)
#define CSR_PMPADDR13_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR13_PMPADDR_31_2_MASK) >> CSR_PMPADDR13_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR14_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR14_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR14_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR14_PMPADDR_31_2_SHIFT) & CSR_PMPADDR14_PMPADDR_31_2_MASK)
#define CSR_PMPADDR14_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR14_PMPADDR_31_2_MASK) >> CSR_PMPADDR14_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register array: PMPADDR */
/*
 * PMPADDR_31_2 (RW)
 *
 * same as pmpaddr0
 */
#define CSR_PMPADDR15_PMPADDR_31_2_MASK (0xFFFFFFFCUL)
#define CSR_PMPADDR15_PMPADDR_31_2_SHIFT (2U)
#define CSR_PMPADDR15_PMPADDR_31_2_SET(x) (((uint32_t)(x) << CSR_PMPADDR15_PMPADDR_31_2_SHIFT) & CSR_PMPADDR15_PMPADDR_31_2_MASK)
#define CSR_PMPADDR15_PMPADDR_31_2_GET(x) (((uint32_t)(x) & CSR_PMPADDR15_PMPADDR_31_2_MASK) >> CSR_PMPADDR15_PMPADDR_31_2_SHIFT)

/* Bitfield definition for register: TSELECT */
/*
 * TRIGGER_INDEX (RW)
 *
 * This register determines which trigger is accessible through other trigger registers.
 */
#define CSR_TSELECT_TRIGGER_INDEX_MASK (0xFFFFFFFFUL)
#define CSR_TSELECT_TRIGGER_INDEX_SHIFT (0U)
#define CSR_TSELECT_TRIGGER_INDEX_SET(x) (((uint32_t)(x) << CSR_TSELECT_TRIGGER_INDEX_SHIFT) & CSR_TSELECT_TRIGGER_INDEX_MASK)
#define CSR_TSELECT_TRIGGER_INDEX_GET(x) (((uint32_t)(x) & CSR_TSELECT_TRIGGER_INDEX_MASK) >> CSR_TSELECT_TRIGGER_INDEX_SHIFT)

/* Bitfield definition for register: TDATA1 */
/*
 * TYPE (RW)
 *
 * Indicates the trigger type.
 * 0:The selected trigger is invalid.
 * 2:The selected trigger is an address/data match trigger.
 * 3:The selected trigger is an instruction count trigger
 * 4:The selected trigger is an interrupt trigger.
 * 5:The selected trigger is an exception trigger.
 */
#define CSR_TDATA1_TYPE_MASK (0xF0000000UL)
#define CSR_TDATA1_TYPE_SHIFT (28U)
#define CSR_TDATA1_TYPE_SET(x) (((uint32_t)(x) << CSR_TDATA1_TYPE_SHIFT) & CSR_TDATA1_TYPE_MASK)
#define CSR_TDATA1_TYPE_GET(x) (((uint32_t)(x) & CSR_TDATA1_TYPE_MASK) >> CSR_TDATA1_TYPE_SHIFT)

