RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6360/hpm_csr_regs.h
/*
 * PPMA (RO)
 *
 * Indicates if programmable PMA setup with PMA region CSRs is supported or not
 * 0:Programmable PMA setup is not supported.
 * 1:Programmable PMA setup is supported.
 */
#define CSR_MMSC_CFG_PPMA_MASK (0x40000000UL)
#define CSR_MMSC_CFG_PPMA_SHIFT (30U)
#define CSR_MMSC_CFG_PPMA_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_PPMA_MASK) >> CSR_MMSC_CFG_PPMA_SHIFT)

/*
 * EDSP (RO)
 *
 * Indicates if the DSP extension is supported or not
 * 0:The DSP extension is not supported.
 * 1:The DSP extension is supported.
 */
#define CSR_MMSC_CFG_EDSP_MASK (0x20000000UL)
#define CSR_MMSC_CFG_EDSP_SHIFT (29U)
#define CSR_MMSC_CFG_EDSP_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_EDSP_MASK) >> CSR_MMSC_CFG_EDSP_SHIFT)

/*
 * VCCTL (RO)
 *
 * Indicates the version number of CCTL command operation scheme supported by an implementation
 * 0:instruction cache and data cache are not configured.
 * 1:instruction cache or data cache is configured.
 */
#define CSR_MMSC_CFG_VCCTL_MASK (0xC0000UL)
#define CSR_MMSC_CFG_VCCTL_SHIFT (18U)
#define CSR_MMSC_CFG_VCCTL_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_VCCTL_MASK) >> CSR_MMSC_CFG_VCCTL_SHIFT)

/*
 * EFHW (RO)
 *
 * Indicates the support of FLHW and FSHW instructions
 * 0:FLHW and FSHW instructions are not supported
 * 1:FLHW and FSHW instructions are supported.
 */
#define CSR_MMSC_CFG_EFHW_MASK (0x20000UL)
#define CSR_MMSC_CFG_EFHW_SHIFT (17U)
#define CSR_MMSC_CFG_EFHW_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_EFHW_MASK) >> CSR_MMSC_CFG_EFHW_SHIFT)

/*
 * CCTLCSR (RO)
 *
 * Indicates the presence of CSRs for CCTL operations.
 * 0:Feature of CSRs for CCTL operations is not supported.
 * 1:Feature of CSRs for CCTL operations is supported.
 */
#define CSR_MMSC_CFG_CCTLCSR_MASK (0x10000UL)
#define CSR_MMSC_CFG_CCTLCSR_SHIFT (16U)
#define CSR_MMSC_CFG_CCTLCSR_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_CCTLCSR_MASK) >> CSR_MMSC_CFG_CCTLCSR_SHIFT)

/*
 * PMNDS (RO)
 *
 * Indicates if Andes-enhanced performance monitoring feature is present or no.
 * 0:Andes-enhanced performance monitoring feature is not supported.
 * 1:Andes-enhanced performance monitoring feature is supported.
 */
#define CSR_MMSC_CFG_PMNDS_MASK (0x8000U)
#define CSR_MMSC_CFG_PMNDS_SHIFT (15U)
#define CSR_MMSC_CFG_PMNDS_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_PMNDS_MASK) >> CSR_MMSC_CFG_PMNDS_SHIFT)

/*
 * LMSLVP (RO)
 *
 * Indicates if local memory slave port is present or not.
 * 0:Local memory slave port is not present.
 * 1:Local memory slave port is implemented.
 */
#define CSR_MMSC_CFG_LMSLVP_MASK (0x4000U)
#define CSR_MMSC_CFG_LMSLVP_SHIFT (14U)
#define CSR_MMSC_CFG_LMSLVP_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_LMSLVP_MASK) >> CSR_MMSC_CFG_LMSLVP_SHIFT)

/*
 * EV5PE (RO)
 *
 * Indicates whether AndeStar V5 Performance Extension is implemented or not. D45 always implements AndeStar V5 Performance Extension.
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_EV5PE_MASK (0x2000U)
#define CSR_MMSC_CFG_EV5PE_SHIFT (13U)
#define CSR_MMSC_CFG_EV5PE_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_EV5PE_MASK) >> CSR_MMSC_CFG_EV5PE_SHIFT)

/*
 * VPLIC (RO)
 *
 * Indicates whether the Andes Vectored PLIC Extension is implemented or not.
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_VPLIC_MASK (0x1000U)
#define CSR_MMSC_CFG_VPLIC_SHIFT (12U)
#define CSR_MMSC_CFG_VPLIC_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_VPLIC_MASK) >> CSR_MMSC_CFG_VPLIC_SHIFT)

/*
 * ACE (RO)
 *
 * Indicates whether the Andes StackSafe hardware stack protection extension is implemented or not.
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_ACE_MASK (0x40U)
#define CSR_MMSC_CFG_ACE_SHIFT (6U)
#define CSR_MMSC_CFG_ACE_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_ACE_MASK) >> CSR_MMSC_CFG_ACE_SHIFT)

/*
 * HSP (RO)
 *
 * Indicates whether the Andes PowerBrake (Performance Throttling) power/performance scaling extension is implemented or not.
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_HSP_MASK (0x20U)
#define CSR_MMSC_CFG_HSP_SHIFT (5U)
#define CSR_MMSC_CFG_HSP_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_HSP_MASK) >> CSR_MMSC_CFG_HSP_SHIFT)

/*
 * PFT (RO)
 *
 * Indicates whether the Andes PowerBrake (Performance Throttling) power/performance scaling extension is implemented or not
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_PFT_MASK (0x10U)
#define CSR_MMSC_CFG_PFT_SHIFT (4U)
#define CSR_MMSC_CFG_PFT_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_PFT_MASK) >> CSR_MMSC_CFG_PFT_SHIFT)

/*
 * ECD (RO)
 *
 * Indicates whether the Andes CoDense Extension is implemented or not.
 * 0:Not implemented.
 * 1:Implemented.
 */
#define CSR_MMSC_CFG_ECD_MASK (0x8U)
#define CSR_MMSC_CFG_ECD_SHIFT (3U)
#define CSR_MMSC_CFG_ECD_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_ECD_MASK) >> CSR_MMSC_CFG_ECD_SHIFT)

/*
 * TLB_ECC (RO)
 *
 * TLB parity/ECC support configuration.
 * 0:No parity/ECC
 * 1:Parity
 * 2:ECC
 * 3:Reserved
 */
#define CSR_MMSC_CFG_TLB_ECC_MASK (0x6U)
#define CSR_MMSC_CFG_TLB_ECC_SHIFT (1U)
#define CSR_MMSC_CFG_TLB_ECC_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_TLB_ECC_MASK) >> CSR_MMSC_CFG_TLB_ECC_SHIFT)

/*
 * ECC (RO)
 *
 * Indicates whether the parity/ECC soft-error protection is implemented or not.
 * 0:Not implemented.
 * 1:Implemented.
 * The specific parity/ECC scheme used for each protected RAM is specified by the control bits in the following list.
 * micm_cfg.IC_ECC
 * micm_cfg.ILM_ECC
 * mdcm_cfg.DC_ECC
 * mdcm_cfg.DLM_ECC
 * mmsc_cfg.TLB_ECC
 */
#define CSR_MMSC_CFG_ECC_MASK (0x1U)
#define CSR_MMSC_CFG_ECC_SHIFT (0U)
#define CSR_MMSC_CFG_ECC_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG_ECC_MASK) >> CSR_MMSC_CFG_ECC_SHIFT)

/* Bitfield definition for register: MMSC_CFG2 */
/*
 * FINV (RO)
 *
 * Indicates if scalar FPU is implemented in VPU
 * 0:Scalar FPU is not implemented in VPU
 * 1:Scalar FPU is implemented in VPU
 */
#define CSR_MMSC_CFG2_FINV_MASK (0x20U)
#define CSR_MMSC_CFG2_FINV_SHIFT (5U)
#define CSR_MMSC_CFG2_FINV_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG2_FINV_MASK) >> CSR_MMSC_CFG2_FINV_SHIFT)

/*
 * ZFH (RO)
 *
 * Indicates if the FP16 half-precision floating-point extension (Zfh) is supported or not.
 * 0:The FP16 extension is not supported.
 * 1:The FP16 extension is supported
 */
#define CSR_MMSC_CFG2_ZFH_MASK (0x2U)
#define CSR_MMSC_CFG2_ZFH_SHIFT (1U)
#define CSR_MMSC_CFG2_ZFH_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG2_ZFH_MASK) >> CSR_MMSC_CFG2_ZFH_SHIFT)

/*
 * BF16CVT (RO)
 *
 * Indicates if the BFLOAT16 conversion extension
 * is supported or not.
 * 0:The BFLOAT16 conversion extension is not supported
 * 1:The BFLOAT16 conversion extension is supported
 */
#define CSR_MMSC_CFG2_BF16CVT_MASK (0x1U)
#define CSR_MMSC_CFG2_BF16CVT_SHIFT (0U)
#define CSR_MMSC_CFG2_BF16CVT_GET(x) (((uint32_t)(x) & CSR_MMSC_CFG2_BF16CVT_MASK) >> CSR_MMSC_CFG2_BF16CVT_SHIFT)


#endif /* HPM_CSR_H */
